Microchip-MPLAB-Harmony/csp/apps/twihs/master/twihs_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/sfr.h
/**
 * \brief Component description for SFR
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-01-23T22:42:14Z */
#ifndef _SAMA5D2_SFR_COMPONENT_H_
#define _SAMA5D2_SFR_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SFR                                          */
/* ************************************************************************** */

/* -------- SFR_DDRCFG : (SFR Offset: 0x04) (R/W 32) DDR Configuration Register -------- */
#define SFR_DDRCFG_FDQIEN_Pos                 _U_(16)                                              /**< (SFR_DDRCFG) Force DDR_DQ Input Buffer Always On Position */
#define SFR_DDRCFG_FDQIEN_Msk                 (_U_(0x1) << SFR_DDRCFG_FDQIEN_Pos)                  /**< (SFR_DDRCFG) Force DDR_DQ Input Buffer Always On Mask */
#define SFR_DDRCFG_FDQIEN(value)              (SFR_DDRCFG_FDQIEN_Msk & ((value) << SFR_DDRCFG_FDQIEN_Pos))
#define SFR_DDRCFG_FDQSIEN_Pos                _U_(17)                                              /**< (SFR_DDRCFG) Force DDR_DQS Input Buffer Always On Position */
#define SFR_DDRCFG_FDQSIEN_Msk                (_U_(0x1) << SFR_DDRCFG_FDQSIEN_Pos)                 /**< (SFR_DDRCFG) Force DDR_DQS Input Buffer Always On Mask */
#define SFR_DDRCFG_FDQSIEN(value)             (SFR_DDRCFG_FDQSIEN_Msk & ((value) << SFR_DDRCFG_FDQSIEN_Pos))
#define SFR_DDRCFG_Msk                        _U_(0x00030000)                                      /**< (SFR_DDRCFG) Register Mask  */


/* -------- SFR_OHCIICR : (SFR Offset: 0x10) (R/W 32) OHCI Interrupt Configuration Register -------- */
#define SFR_OHCIICR_RES0_Pos                  _U_(0)                                               /**< (SFR_OHCIICR) USB PORTx RESET Position */
#define SFR_OHCIICR_RES0_Msk                  (_U_(0x1) << SFR_OHCIICR_RES0_Pos)                   /**< (SFR_OHCIICR) USB PORTx RESET Mask */
#define SFR_OHCIICR_RES0(value)               (SFR_OHCIICR_RES0_Msk & ((value) << SFR_OHCIICR_RES0_Pos))
#define SFR_OHCIICR_RES1_Pos                  _U_(1)                                               /**< (SFR_OHCIICR) USB PORTx RESET Position */
#define SFR_OHCIICR_RES1_Msk                  (_U_(0x1) << SFR_OHCIICR_RES1_Pos)                   /**< (SFR_OHCIICR) USB PORTx RESET Mask */
#define SFR_OHCIICR_RES1(value)               (SFR_OHCIICR_RES1_Msk & ((value) << SFR_OHCIICR_RES1_Pos))
#define SFR_OHCIICR_RES2_Pos                  _U_(2)                                               /**< (SFR_OHCIICR) USB PORTx RESET Position */
#define SFR_OHCIICR_RES2_Msk                  (_U_(0x1) << SFR_OHCIICR_RES2_Pos)                   /**< (SFR_OHCIICR) USB PORTx RESET Mask */
#define SFR_OHCIICR_RES2(value)               (SFR_OHCIICR_RES2_Msk & ((value) << SFR_OHCIICR_RES2_Pos))
#define SFR_OHCIICR_ARIE_Pos                  _U_(4)                                               /**< (SFR_OHCIICR) OHCI Asynchronous Resume Interrupt Enable Position */
#define SFR_OHCIICR_ARIE_Msk                  (_U_(0x1) << SFR_OHCIICR_ARIE_Pos)                   /**< (SFR_OHCIICR) OHCI Asynchronous Resume Interrupt Enable Mask */
#define SFR_OHCIICR_ARIE(value)               (SFR_OHCIICR_ARIE_Msk & ((value) << SFR_OHCIICR_ARIE_Pos))
#define SFR_OHCIICR_APPSTART_Pos              _U_(5)                                               /**< (SFR_OHCIICR) Reserved Position */
#define SFR_OHCIICR_APPSTART_Msk              (_U_(0x1) << SFR_OHCIICR_APPSTART_Pos)               /**< (SFR_OHCIICR) Reserved Mask */
#define SFR_OHCIICR_APPSTART(value)           (SFR_OHCIICR_APPSTART_Msk & ((value) << SFR_OHCIICR_APPSTART_Pos))
#define SFR_OHCIICR_SUSPEND_A_Pos             _U_(8)                                               /**< (SFR_OHCIICR) USB PORT A Position */
#define SFR_OHCIICR_SUSPEND_A_Msk             (_U_(0x1) << SFR_OHCIICR_SUSPEND_A_Pos)              /**< (SFR_OHCIICR) USB PORT A Mask */
#define SFR_OHCIICR_SUSPEND_A(value)          (SFR_OHCIICR_SUSPEND_A_Msk & ((value) << SFR_OHCIICR_SUSPEND_A_Pos))
#define SFR_OHCIICR_SUSPEND_B_Pos             _U_(9)                                               /**< (SFR_OHCIICR) USB PORT B Position */
#define SFR_OHCIICR_SUSPEND_B_Msk             (_U_(0x1) << SFR_OHCIICR_SUSPEND_B_Pos)              /**< (SFR_OHCIICR) USB PORT B Mask */
#define SFR_OHCIICR_SUSPEND_B(value)          (SFR_OHCIICR_SUSPEND_B_Msk & ((value) << SFR_OHCIICR_SUSPEND_B_Pos))
#define SFR_OHCIICR_SUSPEND_C_Pos             _U_(10)                                              /**< (SFR_OHCIICR) USB PORT C Position */
#define SFR_OHCIICR_SUSPEND_C_Msk             (_U_(0x1) << SFR_OHCIICR_SUSPEND_C_Pos)              /**< (SFR_OHCIICR) USB PORT C Mask */
#define SFR_OHCIICR_SUSPEND_C(value)          (SFR_OHCIICR_SUSPEND_C_Msk & ((value) << SFR_OHCIICR_SUSPEND_C_Pos))
#define SFR_OHCIICR_UDPPUDIS_Pos              _U_(23)                                              /**< (SFR_OHCIICR) USB DEVICE PULLUP DISABLE Position */
#define SFR_OHCIICR_UDPPUDIS_Msk              (_U_(0x1) << SFR_OHCIICR_UDPPUDIS_Pos)               /**< (SFR_OHCIICR) USB DEVICE PULLUP DISABLE Mask */
#define SFR_OHCIICR_UDPPUDIS(value)           (SFR_OHCIICR_UDPPUDIS_Msk & ((value) << SFR_OHCIICR_UDPPUDIS_Pos))
#define SFR_OHCIICR_HSIC_SEL_Pos              _U_(27)                                              /**< (SFR_OHCIICR) Reserved Position */
#define SFR_OHCIICR_HSIC_SEL_Msk              (_U_(0x1) << SFR_OHCIICR_HSIC_SEL_Pos)               /**< (SFR_OHCIICR) Reserved Mask */
#define SFR_OHCIICR_HSIC_SEL(value)           (SFR_OHCIICR_HSIC_SEL_Msk & ((value) << SFR_OHCIICR_HSIC_SEL_Pos))
#define SFR_OHCIICR_Msk                       _U_(0x08800737)                                      /**< (SFR_OHCIICR) Register Mask  */

#define SFR_OHCIICR_RES_Pos                   _U_(0)                                               /**< (SFR_OHCIICR Position) USB PORTx RESET */
#define SFR_OHCIICR_RES_Msk                   (_U_(0x7) << SFR_OHCIICR_RES_Pos)                    /**< (SFR_OHCIICR Mask) RES */
#define SFR_OHCIICR_RES(value)                (SFR_OHCIICR_RES_Msk & ((value) << SFR_OHCIICR_RES_Pos)) 

