Microchip-MPLAB-Harmony/csp/apps/twihs/master/twihs_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/sfr.h
/* -------- SFR_UTMIFSTRIM : (SFR Offset: 0x38) (R/W 32) UTMI Full-Speed Trimming Register -------- */
#define SFR_UTMIFSTRIM_RISE_Pos               _U_(0)                                               /**< (SFR_UTMIFSTRIM) FS Transceiver Output Rising Slope Trimming Position */
#define SFR_UTMIFSTRIM_RISE_Msk               (_U_(0x7) << SFR_UTMIFSTRIM_RISE_Pos)                /**< (SFR_UTMIFSTRIM) FS Transceiver Output Rising Slope Trimming Mask */
#define SFR_UTMIFSTRIM_RISE(value)            (SFR_UTMIFSTRIM_RISE_Msk & ((value) << SFR_UTMIFSTRIM_RISE_Pos))
#define SFR_UTMIFSTRIM_FALL_Pos               _U_(4)                                               /**< (SFR_UTMIFSTRIM) FS Transceiver Output Falling Slope Trimming Position */
#define SFR_UTMIFSTRIM_FALL_Msk               (_U_(0x7) << SFR_UTMIFSTRIM_FALL_Pos)                /**< (SFR_UTMIFSTRIM) FS Transceiver Output Falling Slope Trimming Mask */
#define SFR_UTMIFSTRIM_FALL(value)            (SFR_UTMIFSTRIM_FALL_Msk & ((value) << SFR_UTMIFSTRIM_FALL_Pos))
#define SFR_UTMIFSTRIM_XCVR_Pos               _U_(8)                                               /**< (SFR_UTMIFSTRIM) FS Transceiver Crossover Voltage Trimming Position */
#define SFR_UTMIFSTRIM_XCVR_Msk               (_U_(0x3) << SFR_UTMIFSTRIM_XCVR_Pos)                /**< (SFR_UTMIFSTRIM) FS Transceiver Crossover Voltage Trimming Mask */
#define SFR_UTMIFSTRIM_XCVR(value)            (SFR_UTMIFSTRIM_XCVR_Msk & ((value) << SFR_UTMIFSTRIM_XCVR_Pos))
#define SFR_UTMIFSTRIM_ZN_Pos                 _U_(16)                                              /**< (SFR_UTMIFSTRIM) FS Transceiver NMOS Impedance Trimming Position */
#define SFR_UTMIFSTRIM_ZN_Msk                 (_U_(0x7) << SFR_UTMIFSTRIM_ZN_Pos)                  /**< (SFR_UTMIFSTRIM) FS Transceiver NMOS Impedance Trimming Mask */
#define SFR_UTMIFSTRIM_ZN(value)              (SFR_UTMIFSTRIM_ZN_Msk & ((value) << SFR_UTMIFSTRIM_ZN_Pos))
#define SFR_UTMIFSTRIM_ZP_Pos                 _U_(20)                                              /**< (SFR_UTMIFSTRIM) FS Transceiver PMOS Impedance Trimming Position */
#define SFR_UTMIFSTRIM_ZP_Msk                 (_U_(0x7) << SFR_UTMIFSTRIM_ZP_Pos)                  /**< (SFR_UTMIFSTRIM) FS Transceiver PMOS Impedance Trimming Mask */
#define SFR_UTMIFSTRIM_ZP(value)              (SFR_UTMIFSTRIM_ZP_Msk & ((value) << SFR_UTMIFSTRIM_ZP_Pos))
#define SFR_UTMIFSTRIM_Msk                    _U_(0x00770377)                                      /**< (SFR_UTMIFSTRIM) Register Mask  */


/* -------- SFR_UTMISWAP : (SFR Offset: 0x3C) (R/W 32) UTMI DP/DM Pin Swapping Register -------- */
#define SFR_UTMISWAP_PORT0_Pos                _U_(0)                                               /**< (SFR_UTMISWAP) PORT 0 DP/DM Pin Swapping Position */
#define SFR_UTMISWAP_PORT0_Msk                (_U_(0x1) << SFR_UTMISWAP_PORT0_Pos)                 /**< (SFR_UTMISWAP) PORT 0 DP/DM Pin Swapping Mask */
#define SFR_UTMISWAP_PORT0(value)             (SFR_UTMISWAP_PORT0_Msk & ((value) << SFR_UTMISWAP_PORT0_Pos))
#define   SFR_UTMISWAP_PORT0_NORMAL_Val       _U_(0x0)                                             /**< (SFR_UTMISWAP) DP/DM normal pinout.  */
#define   SFR_UTMISWAP_PORT0_SWAPPED_Val      _U_(0x1)                                             /**< (SFR_UTMISWAP) DP/DM swapped pinout.  */
#define SFR_UTMISWAP_PORT0_NORMAL             (SFR_UTMISWAP_PORT0_NORMAL_Val << SFR_UTMISWAP_PORT0_Pos) /**< (SFR_UTMISWAP) DP/DM normal pinout. Position  */
#define SFR_UTMISWAP_PORT0_SWAPPED            (SFR_UTMISWAP_PORT0_SWAPPED_Val << SFR_UTMISWAP_PORT0_Pos) /**< (SFR_UTMISWAP) DP/DM swapped pinout. Position  */
#define SFR_UTMISWAP_PORT1_Pos                _U_(1)                                               /**< (SFR_UTMISWAP) PORT 1 DP/DM Pin Swapping Position */
#define SFR_UTMISWAP_PORT1_Msk                (_U_(0x1) << SFR_UTMISWAP_PORT1_Pos)                 /**< (SFR_UTMISWAP) PORT 1 DP/DM Pin Swapping Mask */
#define SFR_UTMISWAP_PORT1(value)             (SFR_UTMISWAP_PORT1_Msk & ((value) << SFR_UTMISWAP_PORT1_Pos))
#define   SFR_UTMISWAP_PORT1_NORMAL_Val       _U_(0x0)                                             /**< (SFR_UTMISWAP) DP/DM normal pinout.  */
#define   SFR_UTMISWAP_PORT1_SWAPPED_Val      _U_(0x1)                                             /**< (SFR_UTMISWAP) DP/DM swapped pinout.  */
#define SFR_UTMISWAP_PORT1_NORMAL             (SFR_UTMISWAP_PORT1_NORMAL_Val << SFR_UTMISWAP_PORT1_Pos) /**< (SFR_UTMISWAP) DP/DM normal pinout. Position  */
#define SFR_UTMISWAP_PORT1_SWAPPED            (SFR_UTMISWAP_PORT1_SWAPPED_Val << SFR_UTMISWAP_PORT1_Pos) /**< (SFR_UTMISWAP) DP/DM swapped pinout. Position  */
#define SFR_UTMISWAP_PORT2_Pos                _U_(2)                                               /**< (SFR_UTMISWAP) PORT 2 DP/DM Pin Swapping Position */
#define SFR_UTMISWAP_PORT2_Msk                (_U_(0x1) << SFR_UTMISWAP_PORT2_Pos)                 /**< (SFR_UTMISWAP) PORT 2 DP/DM Pin Swapping Mask */
#define SFR_UTMISWAP_PORT2(value)             (SFR_UTMISWAP_PORT2_Msk & ((value) << SFR_UTMISWAP_PORT2_Pos))
#define   SFR_UTMISWAP_PORT2_NORMAL_Val       _U_(0x0)                                             /**< (SFR_UTMISWAP) DP/DM normal pinout.  */
#define   SFR_UTMISWAP_PORT2_SWAPPED_Val      _U_(0x1)                                             /**< (SFR_UTMISWAP) DP/DM swapped pinout.  */
#define SFR_UTMISWAP_PORT2_NORMAL             (SFR_UTMISWAP_PORT2_NORMAL_Val << SFR_UTMISWAP_PORT2_Pos) /**< (SFR_UTMISWAP) DP/DM normal pinout. Position  */
#define SFR_UTMISWAP_PORT2_SWAPPED            (SFR_UTMISWAP_PORT2_SWAPPED_Val << SFR_UTMISWAP_PORT2_Pos) /**< (SFR_UTMISWAP) DP/DM swapped pinout. Position  */
#define SFR_UTMISWAP_Msk                      _U_(0x00000007)                                      /**< (SFR_UTMISWAP) Register Mask  */

#define SFR_UTMISWAP_PORT_Pos                 _U_(0)                                               /**< (SFR_UTMISWAP Position) PORT 2 DP/DM Pin Swapping */
#define SFR_UTMISWAP_PORT_Msk                 (_U_(0x7) << SFR_UTMISWAP_PORT_Pos)                  /**< (SFR_UTMISWAP Mask) PORT */
#define SFR_UTMISWAP_PORT(value)              (SFR_UTMISWAP_PORT_Msk & ((value) << SFR_UTMISWAP_PORT_Pos)) 

/* -------- SFR_CAN : (SFR Offset: 0x48) (R/W 32) CAN Memories Address-based Register -------- */
#define SFR_CAN_EXT_MEM_CAN0_ADDR_Pos         _U_(0)                                               /**< (SFR_CAN) MSB CAN0 DMA Base Address Position */
#define SFR_CAN_EXT_MEM_CAN0_ADDR_Msk         (_U_(0xFFFF) << SFR_CAN_EXT_MEM_CAN0_ADDR_Pos)       /**< (SFR_CAN) MSB CAN0 DMA Base Address Mask */
#define SFR_CAN_EXT_MEM_CAN0_ADDR(value)      (SFR_CAN_EXT_MEM_CAN0_ADDR_Msk & ((value) << SFR_CAN_EXT_MEM_CAN0_ADDR_Pos))
#define SFR_CAN_EXT_MEM_CAN1_ADDR_Pos         _U_(16)                                              /**< (SFR_CAN) MSB CAN1 DMA Base Address Position */
#define SFR_CAN_EXT_MEM_CAN1_ADDR_Msk         (_U_(0xFFFF) << SFR_CAN_EXT_MEM_CAN1_ADDR_Pos)       /**< (SFR_CAN) MSB CAN1 DMA Base Address Mask */
#define SFR_CAN_EXT_MEM_CAN1_ADDR(value)      (SFR_CAN_EXT_MEM_CAN1_ADDR_Msk & ((value) << SFR_CAN_EXT_MEM_CAN1_ADDR_Pos))
#define SFR_CAN_Msk                           _U_(0xFFFFFFFF)                                      /**< (SFR_CAN) Register Mask  */


/* -------- SFR_SN0 : (SFR Offset: 0x4C) ( R/ 32) Serial Number 0 Register -------- */
#define SFR_SN0_SN0_Pos                       _U_(0)                                               /**< (SFR_SN0) Serial Number 0 Position */
#define SFR_SN0_SN0_Msk                       (_U_(0xFFFFFFFF) << SFR_SN0_SN0_Pos)                 /**< (SFR_SN0) Serial Number 0 Mask */
#define SFR_SN0_SN0(value)                    (SFR_SN0_SN0_Msk & ((value) << SFR_SN0_SN0_Pos))    
#define SFR_SN0_Msk                           _U_(0xFFFFFFFF)                                      /**< (SFR_SN0) Register Mask  */


/* -------- SFR_SN1 : (SFR Offset: 0x50) ( R/ 32) Serial Number 1 Register -------- */
#define SFR_SN1_SN1_Pos                       _U_(0)                                               /**< (SFR_SN1) Serial Number 1 Position */
#define SFR_SN1_SN1_Msk                       (_U_(0xFFFFFFFF) << SFR_SN1_SN1_Pos)                 /**< (SFR_SN1) Serial Number 1 Mask */
#define SFR_SN1_SN1(value)                    (SFR_SN1_SN1_Msk & ((value) << SFR_SN1_SN1_Pos))    
#define SFR_SN1_Msk                           _U_(0xFFFFFFFF)                                      /**< (SFR_SN1) Register Mask  */


